app/controllers/avatars_controller.rb

  def index
    render json: Avatar.all, status: :ok
---
SELECT "avatars".* FROM "avatars"