app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "liv"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "profile_img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.create!(user_params)