app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    user = User.find_by!(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "profile_img" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Olivia"], ["profile_img", "https://mir-s3-cdn-cf.behance.net/project_modules/disp/64623a33850498.56ba69ac2a6f7.png"], ["updated_at", "2023-01-13 00:50:04.489998"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    user.update!(user_params)